taskt/Core/Automation/Commands/WebBrowserGroup/SeleniumBrowserGetXPathFromWebElementCommand.dot
digraph "SeleniumBrowserGetXPathFromWebElementCommand" {
"SeleniumBrowserGetXPathFromWebElementCommand" -> "ASeleniumGetWebElementSelectorFromWebElementCommands";
"ASeleniumGetWebElementSelectorFromWebElementCommands" -> "ASeleniumGetOneResultFromWebElementCommands";
"ASeleniumGetOneResultFromWebElementCommands" -> "ASeleniumGetFromWebElementCommands";
"ASeleniumGetOneResultFromWebElementCommands" -> "IResultProperties";
"ASeleniumGetFromWebElementCommands" -> "ASeleniumWebElementActionAndScrollCommands";
"ASeleniumGetFromWebElementCommands" -> "ISeleniumGetFromWebElementProperties";
"ASeleniumWebElementActionAndScrollCommands" -> "ASeleniumWebElementActionCommands";
"ASeleniumWebElementActionAndScrollCommands" -> "ISeleniumWebElementActionAndScrollProperties";
"ASeleniumWebElementActionCommands" -> "ASeleniumDoSomethingToWebElementCommands";
"ASeleniumWebElementActionCommands" -> "ISeleniumWebElementActionProperties";
"ASeleniumDoSomethingToWebElementCommands" -> "ScriptCommand";
"ASeleniumDoSomethingToWebElementCommands" -> "ISeleniumDoSomethingToWebElementProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
