taskt/Core/Automation/Commands/WebBrowserGroup/SeleniumBrowserGetXPathFromWebElementCommand.puml
@startuml
SeleniumBrowserGetXPathFromWebElementCommand --> ASeleniumGetWebElementSelectorFromWebElementCommands
ASeleniumGetWebElementSelectorFromWebElementCommands --> ASeleniumGetOneResultFromWebElementCommands
ASeleniumGetOneResultFromWebElementCommands --> ASeleniumGetFromWebElementCommands
ASeleniumGetOneResultFromWebElementCommands --> IResultProperties
ASeleniumGetFromWebElementCommands --> ASeleniumWebElementActionAndScrollCommands
ASeleniumGetFromWebElementCommands --> ISeleniumGetFromWebElementProperties
ASeleniumWebElementActionAndScrollCommands --> ASeleniumWebElementActionCommands
ASeleniumWebElementActionAndScrollCommands --> ISeleniumWebElementActionAndScrollProperties
ASeleniumWebElementActionCommands --> ASeleniumDoSomethingToWebElementCommands
ASeleniumWebElementActionCommands --> ISeleniumWebElementActionProperties
ASeleniumDoSomethingToWebElementCommands --> ScriptCommand
ASeleniumDoSomethingToWebElementCommands --> ISeleniumDoSomethingToWebElementProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
